Repository: Cieszk/weather_app
Catalog: lib/l10n/app_*.arb
Languages: pl

# appTitle
source: Weather App
pl: Aplikacja pogodowa

source: Weather Details
pl: Szczegóły pogody

source: City
pl: Miasto

source: Country
pl: Kraj

source: Temperature
pl: Temperatura

source: Description
pl: Opis

source: Date
pl: Data

# noWeatherHistory
source: No weather history available.
pl: Brak dostępnej historii pogody.

# inputLabel
source: Enter City, Country
pl: Wprowadź miasto, kraj

source: Get weather
pl: Pobierz pogodę

# mainWeather
source: Main: {mainWeather}
pl: Główna: {mainWeather}

# weatherDescription
source: Description: {description}
pl: Opis: {description}

# temperatureDetail
source: Temperature: {temperature}°C
pl: Temperatura: {temperature}°C

# feelsLike
source: Feels Like: {feelsLike}°C
pl: Odczuwalna: {feelsLike}°C

# humidity
source: Humidity: {humidity}%
pl: Wilgotność: {humidity}%

# windSpeed
source: Wind Speed: {windSpeed} m/s
pl: Prędkość wiatru: {windSpeed} m/s

# pressure
source: Pressure: {pressure} hPa
pl: Ciśnienie: {pressure} hPa

# sunrise
source: Sunrise: {sunrise}
pl: Wschód słońca: {sunrise}

# sunset
source: Sunset: {sunset}
pl: Zachód słońca: {sunset}

# viewWeatherHisotryButton
source: View Weather History
pl: Wyświetl historyczną pogodę

# weatherInLocation
source: Weather in {city}, {country}:
pl: Pogoda w {city}, {country}:

source: Weather History
pl: Pogoda Historyczna

source: Filter by city
pl: Filtruj po mieście

source: Filter by country
pl: Filtruj po mieście

# pickDate
source: Pick a Date
pl: Wybierz datę

# selectedDate
source: Selected Date: {selectedDate}
pl: Wybrana data: {selectedDate}

source: Apply Filters
pl: Zastosuj filtry
